/*1.1
1. JavaScript ბრაუზრეის გარდა მუშაობს სერვერებზე
2. HTML არის მარკირების ენა, რომლითაც იქმნება ვებ–გვერდის ჩონჩხი,
ხოლო JavaScript არის მაღალი დონის დინამიკური და ინტერპრეტირებადი პროგრამირების ენა,
რომელიც ვებ–გვერდს ფუნქციონალს სძენს.
3."ინტერპრეტირებადი ენა" ნიშნავს, რომ კოდი იკითხება და სრულდება ხაზ–ხაზად, გაშვების შემდეგ.
4. JavaScript-ის გარეშე ვებ–გვერდზე ვერ იმუშავებს ინფორმაციის განახლება, ინტერაქციული ფანჯრები და ელემენტები, მონაცემთა დამუშავება.
*/

//1.2
console.log("გამარჯობა, JS!");

//1.3 სკრიპტის ჩასმა ყველაზე ლოგიკურია დამხურავი body ტეგის წინ, ვინაიდან ამ დროს HTML ფაილი სრულად ჩატვირთულია და JS უპრობლემოდ შეძლებს მუშაობას.